def system( text , mode=2 ):
    """
    フォルダ構造などシステムによる変更があったあった場合通知する
    --------------------------------
    input :
        text : メッセージ
    return : なし
    --------------------------------
    """
    if mode == 2:
        print( '\033[32m' + "system:::{}".format( text ) + '\033[0m' )

def message( text , mode=2 ):
    """
    正常な出力
    --------------------------------
    input :
        text : メッセージ
    return : なし
    --------------------------------
    """
    if mode == 2:
        print( '\033[33m' + "log::" + text + '\033[0m' )


def error( text , mode=2 ):
    """
    エラーが起こった場合通知する
    --------------------------------
    input :
        text : メッセージ
    return : なし
    --------------------------------
    """
    print( '\033[31m'+ "error:::{}".format( text ) + '\033[0m' )
